uhnp/src/DataProcessors/ГенерацияМоделиОтчетностиКИК/ГенерацияМоделиОтчетностиКИК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГенерацияМоделиОтчетностиКИК</name>
</mdclass:DataProcessor>

uhnp/src/Enums/СпособыФормированияОтчетов/СпособыФормированияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияОтчетов</name>
  <enumValues>
    <name>РучноеЗаполнение</name>
  </enumValues>
  <enumValues>
    <name>КопированиеЗначений</name>
  </enumValues>
  <enumValues>
    <name>ПоПравилуОбработки</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>Консолидация</name>
  </enumValues>
  <enumValues>
    <name>КонсолидацияПропорционально</name>
  </enumValues>
  <enumValues>
    <name>Элиминация</name>
  </enumValues>
  <enumValues>
    <name>СвернувПоАналитикам</name>
  </enumValues>
  <enumValues>
    <name>СвернувПоПериоду</name>
  </enumValues>
  <enumValues>
    <name>СвернувПоПроектам</name>
  </enumValues>
  <enumValues>
    <name>СвернувПоОрганизациямПроекта</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыПорядокаОпределенияПрибыли/ВидыПорядокаОпределенияПрибыли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПорядокаОпределенияПрибыли</name>
  <enumValues>
    <name>ПоДанннымФинансовойОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПоПравилам25ГлавыНК</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыЗначенийПоказателейОтчетов/ТипыЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВнешниеИнформационныеБазы/ВнешниеИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindows</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСФайлами</name>
    <type>
      <types>EnumRef.ВидыОперацийСФайлами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБНаСервере</name>
    <comment>Имя информационной базы на сервере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <comment>Имя сервера 1С: Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаПолногоИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИмени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НСИ_ТребуетСинхронизации</name>
    <comment>(НСИ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаСтраницу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКWebСервису</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеВнешнейИБ</name>
    <type>
      <types>EnumRef.ВидыРазмещенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйСпособИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТабличногоДокумента</name>
    <type>
      <types>EnumRef.ТипыВнешнихТабличныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключенияWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьФайлыПослеИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайловыйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьЭлементыНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилищаДанныхADO</name>
    <type>
      <types>EnumRef.ТипыХранилищДанныхADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляИмпортаЭталонныйКаталог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьЗначенияВТекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЦентрализованнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDЦентрализованнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИнформационнойСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураИмени</name>
    <attributes>
      <name>НачалоЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>EnumRef.ТипыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/ГенерацияМоделиОтчетностиКИК/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Интерфейс

Процедура ОбновитьНастройкиМатрицы(Регламент) Экспорт

	КодСводныйРегистр = РасчетыПоКорпоративнымНалогам.ПолучитьКодСводныйРегистр();
	
	ГруппаКИК = РасчетыПоКорпоративнымНалогам.ПолучитьГруппуВидовОтчетаКИК();
	ДокНО = Справочники.ДокументыБД.НайтиПоНаименованию("НастраиваемыйОтчет", Истина,, Справочники.ТипыБазДанных.ТекущаяИБ);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	т.Ссылка
		|ИЗ
		|	Справочник.ВнешниеИнформационныеБазы КАК т
		|ГДЕ
		|	т.ТипБД = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ОбменТаблДок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	т.Код ВОЗР");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке("Не создано ни одной внешней информационной базы с типом загрузки из Excel");
		Возврат;
	КонецЕсли;
	ВнешняяИнформационнаяБаза = Результат.Выгрузить().Получить(0).Ссылка;
	
	ТабОрганизации = Регламент.ОрганизационныеЕдиницы.ВыгрузитьКолонку("ОрганизационнаяЕдиница");
	
	ШаблонЗаписи = Новый Структура("ВерсияРегламента", Регламент);
		
	ВыборкаВО = Справочники.ВидыОтчетов.Выбрать(ГруппаКИК);
	Пока ВыборкаВО.Следующий() Цикл
		
		ШаблонЗаписи.Вставить("ШаблонДокумента", ВыборкаВО.Ссылка);
		
		СпособФормированияОтчета = ?(СокрЛП(ВыборкаВО.Код) = КодСводныйРегистр, 
			Перечисления.СпособыФормированияОтчетов.ПоПравилуОбработки, 
			Перечисления.СпособыФормированияОтчетов.Импорт);
		
		БланкиДляОрганизаций = ПолучитьПоказателиИБланки(ВыборкаВО.Ссылка, Ложь);
			
		Для каждого ТекОрганизация Из ТабОрганизации Цикл
			
			ШаблонЗаписи.Вставить("Организация", ТекОрганизация);
			
			ПараметрыНастроек = УправлениеОтчетамиУХ.ПараметрыНастроекОбработкиШаблонов(ШаблонЗаписи);
			ЗначенияНастроек = УправлениеОтчетамиУХ.НастройкиОбработкиШаблонов(ПараметрыНастроек);
			
			Если ЗначениеЗаполнено(БланкиДляОрганизаций.БланкНК)
				И (ТекОрганизация.ПорядокОпределенияПрибыли = Перечисления.ВидыПорядокаОпределенияПрибыли.ПоПравилам25ГлавыНК) Тогда
				
				ЗначенияНастроек.БланкДляОтображения = БланкиДляОрганизаций.БланкНК;
				ЗначенияНастроек.БланкДляИмпорта = БланкиДляОрганизаций.БланкНК;
				
			Иначе
				
				ЗначенияНастроек.БланкДляОтображения = БланкиДляОрганизаций.БланкФО;
				ЗначенияНастроек.БланкДляИмпорта = БланкиДляОрганизаций.БланкФО;
				
			КонецЕсли;
			
			ЗначенияНастроек.СпособФормированияОтчета = СпособФормированияОтчета;
			
			Если СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Импорт Тогда
				ЗначенияНастроек.ВнешняяИнформационнаяБаза = ВнешняяИнформационнаяБаза;
			КонецЕсли;
			
			УправлениеОтчетамиУХ.УстановитьНастройкиОбработкиШаблонов(ПараметрыНастроек, ЗначенияНастроек);
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

Функция ПолучитьПоказателиИБланки(ВидОтчета, ОбновитьБланки = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоказателиОтчетов.Строка.Код КАК КодСтроки,
	|	ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Число)
	|		И ПоказателиОтчетов.НеФинансовый КАК Нефинансовый,
	|	ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяФО КАК ИспользуетсяФО,
	|	ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяНК КАК ИспользуетсяНК
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &ВидОтчета
	|	И НЕ ПоказателиОтчетов.ПометкаУдаления
	|	И (ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Число)
	|				И ПоказателиОтчетов.НеФинансовый
	|			ИЛИ НЕ ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяФО
	|			ИЛИ НЕ ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяНК)");
	
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);	
	ТабПоказатели = Запрос.Выполнить().Выгрузить();
	
	ТребуетсяБланкНК = ТабПоказатели.Найти(Ложь, "ИспользуетсяНК") <> Неопределено;
	
	БланкФО = Неопределено;
	БланкНК = Неопределено;
	
	БланкиДляОчистки = Новый Массив;
	
	Выборка = Справочники.БланкиОтчетов.Выбрать(, ВидОтчета);	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Или Выборка.РежимБланка = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбновитьБланки Тогда
			УправлениеОтчетамиУХ.ОбновитьБланкОтчета(ВидОтчета, Выборка.Ссылка);	
		КонецЕсли;		
		
		Если БланкФО = Неопределено Тогда			
			БланкФО = Выборка.Ссылка;
		ИначеЕсли ТребуетсяБланкНК И (БланкНК = Неопределено) Тогда
			БланкНК = Выборка.Ссылка;
		ИначеЕсли СокрЛП(Выборка.Описание) <> "" Тогда			
			БланкиДляОчистки.Добавить(Выборка.Ссылка);			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат	Новый Структура("БланкФО,БланкНК,БланкиДляОчистки, ТабПоказатели,ТребуетсяБланкНК", 
							БланкФО, БланкНК, БланкиДляОчистки, ТабПоказатели, ТребуетсяБланкНК);

КонецФункции 

#КонецОбласти

#Область ОбновлениеОперандов

Процедура СообщитьОбОшибке(ТекстОшибки, ЛогОшибок = Неопределено)

	Если ЛогОшибок = Неопределено Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки);
	Иначе
		ЛогОшибок = ЛогОшибок + Символы.ПС + ТекстОшибки;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
